[
    {
        "name": "[CS573] Data Visualization",
        "tools": [
            {
                "tool": "d3",
                "icon": "d3.svg"
            }
        ],
        "description": "This course exposes students to the field of data visualization, i.e., the graphical communication of data and information for the purposes of presentation, confirmation, and exploration. The course introduces the stages of the visualization pipeline. This includes data modeling, mapping data attributes to graphical attributes, visual display techniques, tools, paradigms, and perceptual issues. ",
        "status": "In Progress.",
        "category": "Computer Science"
    },
    {
        "name": "[MA4603] Statistical Methods in Genetics and Bioinformatics",
        "tools": [
            {
                "tool": "R",
                "icon": "r.png"
            }
        ],
        "description": "This course provides students with knowledge and understanding of the applications of statistics in modern genetics and bioinformatics. The course generally covers population genetics, genetic epidemiology, and statistical models in bioinformatics. Statistical approaches include log-likelihood ratio tests, score tests, generalized linear models, EM algorithm, Markov chain Monte Carlo, hidden Markov model, and classification and regression trees. ",
        "status": "In Progress.",
        "category": "Math"
    },
    {
        "name": "[MA3831] Principles of Real Analysis I",
        "tools": [
        ],
        "description": " Topics covered include: basic set theory, elementary topology of Euclidean spaces, limits and continuity, differentiation Reimann-Stieltjes integration, infinite series, sequences of functions, and topics in multivariate calculus.",
        "status": "A.",
        "category": "Math"
    },
    {
        "name": "[MA3257] Numerical Methods for Linear and Nonlinear Systems",
        "tools": [
            {
                "tool": "MATLAB",
                "icon": "matlab.png"
            }
        ],
        "description": "This course provides an introduction to modern computational methods for differential and integral calculus and differential equations. Topics covered include: interpolation and polynomial approximation, approximation theory, numerical differentiation and integration, numerical solutions of ordinary differential equations. Error analysis will be emphasized throughout.",
        "status": "A.",
        "category": "Math"
    },
    {
        "name": "[CS4445] Data Mining and Knowledge Discovery in Databases",
        "tools": [
            {
                "tool": "python",
                "icon": "Python.png"
            },
            {
                "tool": "jupyter",
                "icon": "jupyter.png"
            }
        ],
        "description": "This course provides an introduction to Knowledge Discovery in Databases (KDD) and Data Mining. KDD deals with data integration techniques and with the discovery, interpretation and visualization of patterns in large collections of data. Topics covered in this course include data warehousing and mediation techniques; data mining methods such as rule-based learning, decision trees, association rules and sequence mining; and data visualization. The work discussed originates in the fields of artificial intelligence, machine learning, statistical data analysis, data visualization, databases, and information retrieval. ",
        "status": "A.",
        "category": "Computer Science"
    },
    {
        "name": "[CS4241] Webware: Computational Technology for Network Information Systems",
        "tools": [
            {
                "tool": "javascript",
                "icon": "javascript.png"
            }
        ],
        "description": "This course explores the computational aspects of network information systems as embodied by the World Wide Web (WWW). Topics include: languages for document design, programming languages for executable content, scripting languages, design of WWW based human/computer interfaces, client/server network architecture models, high level network protocols (e.g., http), and modern web technologies. ",
        "status": "A.",
        "category": "Computer Science"
    },
    {
        "name": "[CS4341] Introduction to Artificial Intelligence",
        "tools": [
            {
                "tool": "python",
                "icon": "Python.png"
            }
        ],
        "description": "This course studies the problem of making computers act in ways which we call \"intelligent\". Topics include major theories, tools and applications of artificial intelligence, aspects of knowledge representation, searching and planning, and natural language understanding. Students will be expected to complete projects which express problems that require search in state spaces, and to propose appropriate methods for solving the problems. ",
        "status": "A.",
        "category": "Computer Science"
    },
    {
        "name": "[CS4100] Artificial Intelligence for Interactive Media and Games",
        "tools": [
            {
                "tool": "c++",
                "icon": "cpp.png"
            }
        ],
        "description": "This course develops the skill of analyzing the behavior of algorithms. Topics include the analysis, with respect to average and worst case behavior and correctness, of algorithms for internal sorting, pattern matching on strings, graph algorithms, and methods such as recursion elimination, dynamic programming, and program profiling. ",
        "status": "A.",
        "category": "Computer Science"
    },
    {
        "name": "[CS4120] Analysis of Algorithms",
        "tools": [
        ],
        "description": "This course develops the skill of analyzing the behavior of algorithms. Topics include the analysis, with respect to average and worst case behavior and correctness, of algorithms for internal sorting, pattern matching on strings, graph algorithms, and methods such as recursion elimination, dynamic programming, and program profiling. ",
        "status": "A.",
        "category": "Computer Science"
    },
    {
        "name": "[CS3733] Software Engineering",
        "tools": [
            {
                "tool": "java",
                "icon": "java.png"
            }
        ],
        "description": "This course introduces the fundamental principles of software engineering. Modern software development techniques and life cycles are emphasized. Topics include requirements analysis and specification, analysis and design, architecture, implementation, testing and quality, configuration management, and project management. ",
        "status": "A.",
        "category": "Computer Science"
    },
    {
        "name": "[CS3431] Database Systems I",
        "tools": [
            {
                "tool": "MySQL",
                "icon": "mysql.png"
            }
        ],
        "description": " This course introduces the student to the design, use, and application of database management systems. Topics include the relational data model, relational query languages, design theory, and conceptual data design and modeling for relational database design. Techniques that provide for data independence, and minimal redundancy will be discussed.  ",
        "status": "A.",
        "category": "Computer Science"
    },
    {
        "name": "[CS525] Informational Retrieval Methods for Social Web",
        "tools": [
        ],
        "description": "",
        "status": "To take.",
        "category": "Computer Science"
    },
    {
        "name": "[CS585] Big Data Management",
        "tools": [
        ],
        "description": "This course introduces the emerging techniques and infrastructures developed for big data management including parallel and distributed database systems, map-reduce infrastructures, scalable platforms for complex data types, stream processing systems, and cloud-based computing. Query processing, optimization, access methods, storage layouts, and energy management techniques developed on these infrastructures will be covered. ",
        "status": "To take.",
        "category": "Computer Science"
    },
    {
        "name": "[CS539] Machine Learning",
        "tools": [
        ],
        "description": "The focus of this course is machine learning for knowledge-based systems. It will include reviews of work on similarity-based learning (induction), explanation-based learning, analogical and case-based reasoning and learning, and knowledge compilation. It will also consider other approaches to automated knowledge acquisition as well as connectionist learning. ",
        "status": "To take.",
        "category": "Computer Science"
    }

 ]